[Killed] ObjectLiteral
main/components/MenuItemReviews/MenuItemReviewForm.jsx:53:38
               id="itemId"
               type="text"
               isInvalid={Boolean(errors.itemId)}
-              {...register("itemId", {
-                required: "Item Id is required.",
-                pattern: {
-                  value: id_regex,
-                  message: "Item Id must correspond to a valid menu item.",
-                },
-              })}
+              {...register("itemId", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests Correct Error messages on bad input
statusReason: Unable to find an element with the text: /Item Id must correspond to a valid menu item./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
