[Killed] BlockStatement
src/main/utils/useCurrentUser.js:7:26
 export function useCurrentUser() {
   const queryResults = useQuery({
     queryKey: ["current user"],
-    queryFn: async () => {
-      try {
-        const response = await axios.get("/api/currentUser");
-        if (response.data == null) {
-          return { loggedIn: false, root: {} };
-        }
-        if (!(response.data instanceof Object) || !("roles" in response.data)) {
-          return { loggedIn: false, root: response.data };
-        }
-        let rolesList = response.data.roles.map((r) => r.authority);
-        response.data = { ...response.data, rolesList: rolesList };
-        return { loggedIn: true, root: response.data };
-      } catch (e) {
-        if (e.response?.status === 403) {
-          return { loggedIn: false, root: {} };
-        } else {
-          console.error("Error invoking axios.get: ", e);
-          throw e;
-        }
-      }
-    },
+    queryFn: async () => {},
     initialData: { loggedIn: false, root: null, initialData: true },
   });
killedBy: UCSBDatesEditPage tests when the backend doesn't return data renders header but table is not present
statusReason: Unable to find an element with the text: /Welcome/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
src/main/utils/useCurrentUser.js:19:19
         let rolesList = response.data.roles.map((r) => r.authority);
         response.data = { ...response.data, rolesList: rolesList };
         return { loggedIn: true, root: response.data };
-      } catch (e) {
-        if (e.response?.status === 403) {
-          return { loggedIn: false, root: {} };
-        } else {
-          console.error("Error invoking axios.get: ", e);
-          throw e;
-        }
-      }
+      } catch (e) {}
     },
     initialData: { loggedIn: false, root: null, initialData: true },
killedBy: utils/currentUser tests useCurrentUser should return loggedIn: false on a 403 error
statusReason: expected null to deeply equal {}

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BlockStatement
src/main/utils/useCurrentUser.js:20:41
         response.data = { ...response.data, rolesList: rolesList };
         return { loggedIn: true, root: response.data };
       } catch (e) {
-        if (e.response?.status === 403) {
-          return { loggedIn: false, root: {} };
-        } else {
+        if (e.response?.status === 403) {} else {
           console.error("Error invoking axios.get: ", e);
           throw e;
killedBy: utils/currentUser tests useCurrentUser should return loggedIn: false on a 403 error
statusReason: expected null to deeply equal {}

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] ConditionalExpression
src/main/utils/useCurrentUser.js:20:13
         response.data = { ...response.data, rolesList: rolesList };
         return { loggedIn: true, root: response.data };
       } catch (e) {
-        if (e.response?.status === 403) {
+        if (false) {
           return { loggedIn: false, root: {} };
         } else {
killedBy: utils/currentUser tests useCurrentUser should return loggedIn: false on a 403 error
statusReason: expected null to deeply equal {}

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] BooleanLiteral
src/main/utils/useCurrentUser.js:21:30
         return { loggedIn: true, root: response.data };
       } catch (e) {
         if (e.response?.status === 403) {
-          return { loggedIn: false, root: {} };
+          return { loggedIn: true, root: {} };
         } else {
           console.error("Error invoking axios.get: ", e);
killedBy: utils/currentUser tests useCurrentUser should return loggedIn: false on a 403 error
statusReason: expected true to be false // Object.is equality

[Killed] ObjectLiteral
src/main/utils/useCurrentUser.js:21:18
         return { loggedIn: true, root: response.data };
       } catch (e) {
         if (e.response?.status === 403) {
-          return { loggedIn: false, root: {} };
+          return {};
         } else {
           console.error("Error invoking axios.get: ", e);
killedBy: utils/currentUser tests useCurrentUser should return loggedIn: false on a 403 error
statusReason: expected undefined to deeply equal {}

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>
