[Killed] ObjectLiteral
main/components/HelpRequest/HelpRequestForm.jsx:58:46
               type="text"
               placeholder="e.g. davidgaucho@ucsb.edu"
               isInvalid={Boolean(errors.requesterEmail)}
-              {...register("requesterEmail", {
-                required: "Requester Email is required.",
-                pattern: {
-                  value: email_regex,
-                  message: "Requester Email must be a valid email address.",
-                },
-              })}
+              {...register("requesterEmail", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: HelpRequestForm tests Correct Error messsages on bad input
statusReason: Unable to find an element with the text: /Requester Email must be a valid email address./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestForm.jsx:62:28
                 required: "Requester Email is required.",
                 pattern: {
                   value: email_regex,
-                  message: "Requester Email must be a valid email address.",
+                  message: "",
                 },
               })}
killedBy: HelpRequestForm tests Correct Error messsages on bad input
statusReason: Unable to find an element with the text: /Requester Email must be a valid email address./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/HelpRequest/HelpRequestForm.jsx:81:38
               type="text"
               placeholder="e.g. 04"
               isInvalid={Boolean(errors.teamId)}
-              {...register("teamId", {
-                required: "Team Id is required.",
-                pattern: {
-                  value: id_regex,
-                  message: "Team Id must be a number.",
-                },
-              })}
+              {...register("teamId", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: HelpRequestForm tests Correct Error messsages on bad input
statusReason: Unable to find an element with the text: /Team Id must be a number./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/HelpRequest/HelpRequestForm.jsx:106:51
               type="text"
               placeholder="e.g. 04"
               isInvalid={Boolean(errors.tableOrBreakoutRoom)}
-              {...register("tableOrBreakoutRoom", {
-                required: "Table Or Breakout Room is required.",
-                pattern: {
-                  value: id_regex,
-                  message: "Table Or Breakout Room must be a number.",
-                },
-              })}
+              {...register("tableOrBreakoutRoom", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: HelpRequestForm tests Correct Error messsages on bad input
statusReason: Unable to find an element with the text: /Table Or Breakout Room must be a number./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/HelpRequest/HelpRequestForm.jsx:108:26
               isInvalid={Boolean(errors.tableOrBreakoutRoom)}
               {...register("tableOrBreakoutRoom", {
                 required: "Table Or Breakout Room is required.",
-                pattern: {
-                  value: id_regex,
-                  message: "Table Or Breakout Room must be a number.",
-                },
+                pattern: {},
               })}
             />
killedBy: HelpRequestForm tests Correct Error messsages on bad input
statusReason: Unable to find an element with the text: /Table Or Breakout Room must be a number./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/HelpRequest/HelpRequestForm.jsx:152:28
               isInvalid={Boolean(errors.explanation)}
               {...register("explanation", {
                 required: "Explanation is required.",
-                maxLength: {
-                  value: 255,
-                  message: "Explanation must be at most 255 characters.",
-                },
+                maxLength: {},
               })}
             />
killedBy: HelpRequestForm tests Correct Error messsages on bad input
statusReason: Unable to find an element with the text: /Explanation must be at most 255 characters./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestForm.jsx:154:28
                 required: "Explanation is required.",
                 maxLength: {
                   value: 255,
-                  message: "Explanation must be at most 255 characters.",
+                  message: "",
                 },
               })}
killedBy: HelpRequestForm tests Correct Error messsages on bad input
statusReason: Unable to find an element with the text: /Explanation must be at most 255 characters./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
