[Killed] BlockStatement
main/components/HelpRequest/HelpRequestTable.jsx:15:34
 export default function HelpRequestTable({ helpRequests, currentUser }) {
   const navigate = useNavigate();
 
-  const editCallback = (cell) => {
-    navigate(`/HelpRequest/edit/${cell.row.original.id}`);
-  };
+  const editCallback = (cell) => {};
 
   // Stryker disable all : hard to test for query caching
killedBy: UserTable tests Edit button navigates to the edit page for admin user
statusReason: expected "spy" to be called with arguments: [ '/HelpRequest/edit/1' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ObjectLiteral
main/components/HelpRequest/HelpRequestTable.jsx:38:5
       header: "id",
       accessorKey: "id", // accessor is the "key" in the data
     },
-    {
-      header: "Requester Email",
-      accessorKey: "requesterEmail",
-    },
+    {},
     {
       header: "Team Id",
killedBy: UserTable tests Has the expected column headers, content for ordinary user
statusReason: Columns require an id when using a non-string header

[Killed] ObjectLiteral
main/components/HelpRequest/HelpRequestTable.jsx:46:5
       header: "Team Id",
       accessorKey: "teamId",
     },
-    {
-      header: "Table Or Breakout Room",
-      accessorKey: "tableOrBreakoutRoom",
-    },
+    {},
     {
       header: "Request Time (ISO Format)",
killedBy: UserTable tests Has the expected column headers, content for ordinary user
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestTable.jsx:48:20
     },
     {
       header: "Table Or Breakout Room",
-      accessorKey: "tableOrBreakoutRoom",
+      accessorKey: "",
     },
     {
killedBy: UserTable tests Has the expected column headers, content for ordinary user
statusReason: Unable to find an element by: [data-testid="HelpRequestTable-cell-row-0-col-tableOrBreakoutRoom"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="HelpRequestTable"

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestTable.jsx:77:15
     <OurTable
       data={helpRequests}
       columns={columns}
-      testid={"HelpRequestTable"}
+      testid={""}
     />
   );
killedBy: UserTable tests Has the expected column headers, content for ordinary user
statusReason: Unable to find an element by: [data-testid="HelpRequestTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid=""
