[Killed] BlockStatement
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemTable.jsx:15:34
 export default function UCSBDiningCommonsMenuItemTable({ menuItems, currentUser }) {
   const navigate = useNavigate();
 
-  const editCallback = (cell) => {
-    navigate(`/ucsbmenuitem/edit/${cell.row.original.id}`);
-  };
+  const editCallback = (cell) => {};
 
   // Stryker disable all : hard to test for query caching
killedBy: UCSBDiningCommonsMenuItemTable tests Edit button navigates to the edit page for admin user
statusReason: expected "spy" to be called with arguments: [ '/ucsbmenuitem/edit/1' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemTable.jsx:16:14
   const navigate = useNavigate();
 
   const editCallback = (cell) => {
-    navigate(`/ucsbmenuitem/edit/${cell.row.original.id}`);
+    navigate(``);
   };
 
killedBy: UCSBDiningCommonsMenuItemTable tests Edit button navigates to the edit page for admin user
statusReason: expected "spy" to be called with arguments: [ '/ucsbmenuitem/edit/1' ]

Received: 

  1st spy call:

  [
-   "/ucsbmenuitem/edit/1",

[Killed] BlockStatement
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemTable.jsx:52:43
     },
   ];
 
-  if (hasRole(currentUser, "ROLE_ADMIN")) {
-    columns.push(
-      ButtonColumn("Edit", "primary", editCallback, "UCSBDiningCommonsMenuItemTable"),
-    );
-    columns.push(
-      ButtonColumn("Delete", "danger", deleteCallback, "UCSBDiningCommonsMenuItemTable"),
-    );
-  }
+  if (hasRole(currentUser, "ROLE_ADMIN")) {}
 
   return <OurTable data={menuItems} columns={columns} testid={"UCSBDiningCommonsMenuItemTable"} />;
killedBy: UCSBDiningCommonsMenuItemTable tests Has the expected column headers and content for admin user
statusReason: Unable to find an element by: [data-testid="UCSBDiningCommonsMenuItemTable-cell-row-0-col-Edit-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="UCSBDiningCommonsMenuItemTable"

[Killed] StringLiteral
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemTable.jsx:54:53
 
   if (hasRole(currentUser, "ROLE_ADMIN")) {
     columns.push(
-      ButtonColumn("Edit", "primary", editCallback, "UCSBDiningCommonsMenuItemTable"),
+      ButtonColumn("Edit", "primary", editCallback, ""),
     );
     columns.push(
killedBy: UCSBDiningCommonsMenuItemTable tests Has the expected column headers and content for admin user
statusReason: Unable to find an element by: [data-testid="UCSBDiningCommonsMenuItemTable-cell-row-0-col-Edit-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="UCSBDiningCommonsMenuItemTable"
