[Killed] BlockStatement
main/pages/HelpRequest/HelpRequestIndexPage.jsx:13:45
   const currentUser = useCurrentUser();
 
   const createButton = () => {
-    if (hasRole(currentUser, "ROLE_ADMIN")) {
-      return (
-        <Button
-          variant="primary"
-          href="/HelpRequest/create"
-          style={{ float: "right" }}
-        >
-          Create HelpRequest
-        </Button>
-      );
-    }
+    if (hasRole(currentUser, "ROLE_ADMIN")) {}
   };
 
killedBy: HelpRequestIndexPage tests Renders with Create Button for admin user
statusReason: Unable to find an element with the text: /Create HelpRequest/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/pages/HelpRequest/HelpRequestIndexPage.jsx:18:27
         <Button
           variant="primary"
           href="/HelpRequest/create"
-          style={{ float: "right" }}
+          style={{ float: "" }}
         >
           Create HelpRequest
killedBy: HelpRequestIndexPage tests Renders with Create Button for admin user
statusReason: expect(element).toHaveAttribute("style", "float: right;") // element.getAttribute("style") === "float: right;"

Expected the element to have attribute:
  style="float: right;"
Received:
  null

[Killed] StringLiteral
main/pages/HelpRequest/HelpRequestIndexPage.jsx:33:15
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     ["/api/HelpRequest/all"],
-    { method: "GET", url: "/api/HelpRequest/all" },
+    { method: "", url: "/api/HelpRequest/all" },
     [],
   );
killedBy: HelpRequestIndexPage tests renders empty table when backend unavailable, user only
statusReason: expected 'Error communicating with backend via …' to match 'Error communicating with backend via …'
