[Killed] ArrayDeclaration
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemTable.jsx:36:19
     deleteMutation.mutate(cell);
   };
 
-  const columns = [
-    {
-      header: "ID",
-      accessorKey: "id", // accessor is the "key" in the data
-    },
-    {
-      header: "Dining Commons Code",
-      accessorKey: "diningCommonsCode",
-    },
-    {
-      header: "Name",
-      accessorKey: "name",
-    },
-    {
-      header: "Station",
-      accessorKey: "station",
-    },
-  ];
+  const columns = [];
 
   if (hasRole(currentUser, "ROLE_ADMIN")) {
killedBy: UCSBDiningCommonsMenuItemTable tests Has the expected column headers and content for ordinary user
statusReason: Unable to find an element with the text: ID. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="UCSBDiningCommonsMenuItemTable"

[Killed] ObjectLiteral
main/components/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemTable.jsx:37:5
   };
 
   const columns = [
-    {
-      header: "ID",
-      accessorKey: "id", // accessor is the "key" in the data
-    },
+    {},
     {
       header: "Dining Commons Code",
killedBy: UCSBDiningCommonsMenuItemIndexPage tests Renders with Create Button for admin user
statusReason: Columns require an id when using a non-string header
