[Killed] ArrowFunction
main/pages/UCSBDiningCommonsMenuItem/UCSBDiningCommonsMenuItemCreatePage.jsx:10:31
 export default function UCSBDiningCommonsMenuItemCreatePage({
   storybook = false,
 }) {
-  const objectToAxiosParams = (menuItem) => ({
-    url: "/api/ucsbdiningcommonsmenuitem/post", // ✅ fixed path
-    method: "POST",
-    params: {
-      diningCommonsCode: menuItem.diningCommonsCode,
-      name: menuItem.name,
-      station: menuItem.station,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (menuItem) => {
killedBy: UCSBDiningCommonsMenuItemCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div
