[NoCoverage] BlockStatement
main/pages/MenuItemReviews/MenuItemReviewsCreatePage.jsx:3:53
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-export default function MenuItemReviewsCreatePage() {
-  // Stryker disable all : placeholder for future implementation
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Create page not yet implemented</h1>
-      </div>
-    </BasicLayout>
-  );
-}
+export default function MenuItemReviewsCreatePage() {}
 
