[NoCoverage] BlockStatement
main/pages/MenuItemReviews/MenuItemReviewsEditPage.jsx:3:51
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-export default function MenuItemReviewsEditPage() {
-  // Stryker disable all : placeholder for future implementation
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Edit page not yet implemented</h1>
-      </div>
-    </BasicLayout>
-  );
-}
+export default function MenuItemReviewsEditPage() {}
 
