[NoCoverage] BlockStatement
main/pages/MenuItemReviews/MenuItemReviewsIndexPage.jsx:3:52
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-export default function MenuItemReviewsIndexPage() {
-  // Stryker disable all : placeholder for future implementation
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Index page not yet implemented</h1>
-        <p>
-          <a href="/menuitemreview/create">Create</a>
-        </p>
-        <p>
-          <a href="/menuitemreview/edit/1">Edit</a>
-        </p>
-      </div>
-    </BasicLayout>
-  );
-}
+export default function MenuItemReviewsIndexPage() {}
 
