[Killed] ObjectLiteral
main/components/MenuItemReviews/MenuItemReviewForm.jsx:53:39
               id="item_id"
               type="text"
               isInvalid={Boolean(errors.item_id)}
-              {...register("item_id", {
-                required: "Item Id is required.",
-                pattern: {
-                  value: id_regex,
-                  message: "Item Id must correspond to a valid menu item.",
-                },
-              })}
+              {...register("item_id", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests Correct Error messages on bad input
statusReason: Unable to find an element with the text: /Item Id must correspond to a valid menu item./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/MenuItemReviews/MenuItemReviewForm.jsx:53:28
               id="item_id"
               type="text"
               isInvalid={Boolean(errors.item_id)}
-              {...register("item_id", {
+              {...register("", {
                 required: "Item Id is required.",
                 pattern: {
killedBy: MenuItemReviewForm tests renders correctly
statusReason: Cannot read properties of undefined (reading '_f')

[Killed] OptionalChaining
main/components/MenuItemReviews/MenuItemReviewForm.jsx:62:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.item_id?.message}
+              {errors.item_id.message}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: MenuItemReviewForm tests renders correctly
statusReason: Cannot read properties of undefined (reading 'message')

[Killed] StringLiteral
main/components/MenuItemReviews/MenuItemReviewForm.jsx:70:43
           <Form.Group className="mb-3">
             <Form.Label htmlFor="reviewer_email">Reviewer Email</Form.Label>
             <Form.Control
-              data-testid={testIdPrefix + "-reviewer_email"}
+              data-testid={testIdPrefix + ""}
               id="reviewer_email"
               type="text"
killedBy: MenuItemReviewForm tests Correct Error messages on bad input
statusReason: Unable to find an element by: [data-testid="MenuItemReviewForm-reviewer_email"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/MenuItemReviews/MenuItemReviewForm.jsx:74:46
               id="reviewer_email"
               type="text"
               isInvalid={Boolean(errors.reviewer_email)}
-              {...register("reviewer_email", {
-                required: "Reviewer Email is required.",
-                pattern: {
-                  value: email_regex,
-                  message: "Reviewer Email must be a valid email address.",
-                },
-              })}
+              {...register("reviewer_email", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests Correct Error messages on bad input
statusReason: Unable to find an element with the text: /Reviewer Email must be a valid email address./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/MenuItemReviews/MenuItemReviewForm.jsx:74:28
               id="reviewer_email"
               type="text"
               isInvalid={Boolean(errors.reviewer_email)}
-              {...register("reviewer_email", {
+              {...register("", {
                 required: "Reviewer Email is required.",
                 pattern: {
killedBy: MenuItemReviewForm tests renders correctly
statusReason: Cannot read properties of undefined (reading '_f')

[Killed] StringLiteral
main/components/MenuItemReviews/MenuItemReviewForm.jsx:75:27
               type="text"
               isInvalid={Boolean(errors.reviewer_email)}
               {...register("reviewer_email", {
-                required: "Reviewer Email is required.",
+                required: "",
                 pattern: {
                   value: email_regex,
killedBy: MenuItemReviewForm tests Correct Error messages on missing input
statusReason: Unable to find an element with the text: /Reviewer Email is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/MenuItemReviews/MenuItemReviewForm.jsx:78:28
                 required: "Reviewer Email is required.",
                 pattern: {
                   value: email_regex,
-                  message: "Reviewer Email must be a valid email address.",
+                  message: "",
                 },
               })}
killedBy: MenuItemReviewForm tests Correct Error messages on bad input
statusReason: Unable to find an element with the text: /Reviewer Email must be a valid email address./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] OptionalChaining
main/components/MenuItemReviews/MenuItemReviewForm.jsx:83:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.reviewer_email?.message}
+              {errors.reviewer_email.message}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: MenuItemReviewForm tests renders correctly
statusReason: Cannot read properties of undefined (reading 'message')

[Killed] ObjectLiteral
main/components/MenuItemReviews/MenuItemReviewForm.jsx:97:22
               isInvalid={Boolean(errors.stars)}
               {...register("stars", {
                 required: "Stars is required.",
-                min: {
-                  value: 1,
-                  message: "Stars must be between 1 and 5.",
-                },
+                min: {},
                 max: {
                   value: 5,
killedBy: MenuItemReviewForm tests Correct Stars Error message when less than 1
statusReason: Unable to find an element with the text: /Stars must be between 1 and 5./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/MenuItemReviews/MenuItemReviewForm.jsx:103:28
                 },
                 max: {
                   value: 5,
-                  message: "Stars must be between 1 and 5.",
+                  message: "",
                 },
               })}
killedBy: MenuItemReviewForm tests Correct Error messages on bad input
statusReason: Unable to find an element with the text: /Stars must be between 1 and 5./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/MenuItemReviews/MenuItemReviewForm.jsx:120:40
               id="comments"
               type="text"
               isInvalid={Boolean(errors.comments)}
-              {...register("comments", {
-                required: "Comments is required.",
-                maxLength: {
-                  value: 255,
-                  message: "Comments must be at most 255 characters.",
-                },
-              })}
+              {...register("comments", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: MenuItemReviewForm tests Correct Error messages on bad input
statusReason: Unable to find an element with the text: /Comments must be at most 255 characters./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/MenuItemReviews/MenuItemReviewForm.jsx:124:28
                 required: "Comments is required.",
                 maxLength: {
                   value: 255,
-                  message: "Comments must be at most 255 characters.",
+                  message: "",
                 },
               })}
killedBy: MenuItemReviewForm tests Correct Error messages on bad input
statusReason: Unable to find an element with the text: /Comments must be at most 255 characters./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
