[Killed] ObjectLiteral
main/components/Articles/ArticleForm.jsx:56:37
               id="title"
               type="text"
               isInvalid={Boolean(errors.title)}
-              {...register("title", {
-                required: "Title is required.",
-                maxLength: {
-                  value: 255,
-                  message: "Title must be at most 255 characters.",
-                },
-              })}
+              {...register("title", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: ArticleForm tests Correct Error messages on bad input
statusReason: Unable to find an element with the text: /Title must be at most 255 characters./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/Articles/ArticleForm.jsx:122:37
               id="email"
               type="text"
               isInvalid={Boolean(errors.email)}
-              {...register("email", {
-                required: "Email is required.",
-                maxLength: {
-                  value: 255,
-                  message: "Email must be at most 255 characters.",
-                },
-                pattern: {
-                  value: email_regex,
-                  message: 'Email should contain one "@" and one ".".',
-                },
-              })}
+              {...register("email", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: ArticleForm tests Correct Error messages on bad input
statusReason: Unable to find an element with the text: /Email must be at most 255 characters./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/Articles/ArticleForm.jsx:124:28
               isInvalid={Boolean(errors.email)}
               {...register("email", {
                 required: "Email is required.",
-                maxLength: {
-                  value: 255,
-                  message: "Email must be at most 255 characters.",
-                },
+                maxLength: {},
                 pattern: {
                   value: email_regex,
killedBy: ArticleForm tests Correct Error messages on bad input
statusReason: Unable to find an element with the text: /Email must be at most 255 characters./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/Articles/ArticleForm.jsx:128:26
                   value: 255,
                   message: "Email must be at most 255 characters.",
                 },
-                pattern: {
-                  value: email_regex,
-                  message: 'Email should contain one "@" and one ".".',
-                },
+                pattern: {},
               })}
             />
killedBy: ArticleForm tests Correct Email Error message
statusReason: Unable to find an element with the text: /Email should contain one "@" and one "."./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
