[Killed] ObjectLiteral
main/components/HelpRequest/HelpRequestForm.jsx:152:28
               isInvalid={Boolean(errors.explanation)}
               {...register("explanation", {
                 required: "Explanation is required.",
-                maxLength: {
-                  value: 250,
-                  message: "Explanation must be at most 250 characters.",
-                },
+                maxLength: {},
               })}
             />
killedBy: HelpRequestForm tests Correct Error messsages on bad input
statusReason: Unable to find an element with the text: /Explanation must be at most 250 characters./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestForm.jsx:154:28
                 required: "Explanation is required.",
                 maxLength: {
                   value: 250,
-                  message: "Explanation must be at most 250 characters.",
+                  message: "",
                 },
               })}
killedBy: HelpRequestForm tests Correct Error messsages on bad input
statusReason: Unable to find an element with the text: /Explanation must be at most 250 characters./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
