[Killed] ConditionalExpression
main/components/UCSBOrganization/UCSBOrganizationForm.jsx:24:8
 
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
-      {initialContents && (
-        <Form.Group className="mb-3">
-          <Form.Label htmlFor="orgCode">OrgCode</Form.Label>
-          <Form.Control
-            data-testid={testIdPrefix + "-orgCode"}
-            id="orgCode"
-            type="text"
-            {...register("orgCode")}
-            value={initialContents.orgCode}
-            disabled
-          />
-        </Form.Group>
-      )}
+      {false}
 
       <Form.Group className="mb-3">
killedBy: UCSBOrganizationForm tests renders correctly when passing in initialContents
statusReason: Unable to find an element by: [data-testid="UCSBOrganizationForm-orgCode"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/UCSBOrganization/UCSBOrganizationForm.jsx:24:8
 
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
-      {initialContents && (
-        <Form.Group className="mb-3">
-          <Form.Label htmlFor="orgCode">OrgCode</Form.Label>
-          <Form.Control
-            data-testid={testIdPrefix + "-orgCode"}
-            id="orgCode"
-            type="text"
-            {...register("orgCode")}
-            value={initialContents.orgCode}
-            disabled
-          />
-        </Form.Group>
-      )}
+      {true}
 
       <Form.Group className="mb-3">
killedBy: UCSBOrganizationForm tests renders correctly when passing in initialContents
statusReason: Unable to find an element by: [data-testid="UCSBOrganizationForm-orgCode"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
